app/views/users/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY rank DESC  [["user_id", 9]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 9]]
---
         <small>
           <%= pluralize(@user.posts.count, 'post') %>,
           <%= pluralize(@user.comments.count, 'comment') %>

SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]
---
 <h2>Posts</h2>
 <% if @user.posts.empty? %>

SELECT  1 AS one FROM "comments" WHERE "comments"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]
---
 <h2>Comments</h2>
 <% if @user.comments.empty? %>