app/controllers/comments_controller.rb

  def destroy
     @post = Post.find(params[:post_id])
     comment = @post.comments.find(params[:id])

     if comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 48], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 48], ["id", 101], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 101]]

  def create
    @post = Post.find(params[:post_id])
     comment = @post.comments.new(comment_params)
     comment.user = current_user

    if comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 48], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Test Comment"], ["post_id", 48], ["created_at", "2017-12-15 19:50:55.255945"], ["updated_at", "2017-12-15 19:50:55.255945"], ["user_id", 6]]