app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    # #11 we declare an instance variable @posts and assign it a collection of Post objects using the all method provided by ActiveRecord. all returns a collection of  Post objects.
     @posts = Post.all