app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 53], ["LIMIT", 1]]

  def create
   @post = Post.new
   @post.title = params[:post][:title]
   @post.body = params[:post][:body]
   @topic = Topic.find(params[:topic_id])

   @post.topic = @topic

    if @post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "topic_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Tucker Test Post"], ["body", "Tucker Testing Posts"], ["created_at", "2017-12-12 20:50:16.054407"], ["updated_at", "2017-12-12 20:50:16.054407"], ["topic_id", 16], ["user_id", 1]]

  def edit
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 39], ["LIMIT", 1]]

  def update
     @post = Post.find(params[:id])
     @post.title = params[:post][:title]
     @post.body = params[:post][:body]

     if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Tucker's First Edited Post"], ["body", "This is the content of my first edited post on Bloccit."], ["updated_at", "2017-11-27 19:49:30.113270"], ["id", 1]]

  def destroy
     @post = Post.find(params[:id])

 # #8 we call destroy on @post. If that call is successful, we set a flash message and redirect the user to the posts index view.
 # #  If destroy fails then we redirect the user to the show view using render :show.
     if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 39], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]