app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tucker's New Topic"], ["description", "Topic that's new and was created by Tucker"], ["created_at", "2017-11-28 19:21:55.394236"], ["updated_at", "2017-11-28 19:21:55.394236"]]
---
    def create
     @topic = Topic.new
     @topic.name = params[:topic][:name]
     @topic.description = params[:topic][:description]
     @topic.public = params[:topic][:public]

     if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "topics" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["name", "Tucker's Edited Topic"], ["description", "Tucker edited this topic"], ["updated_at", "2017-11-28 19:26:15.173818"], ["id", 1]]
---
    def update
     @topic = Topic.find(params[:id])
     @topic.assign_attributes(topic_params)

     if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 2]]
---
    def destroy
     @topic = Topic.find(params[:id])

     if @topic.destroy